[Survived] ObjectLiteral
src/app.ts:21:21
 } from "@common-ticketing-microservices/common";
 
 const whitelist = ["*"]; // arreglo con todos los fronts que va aceptar
-const corsOptions = {
-  origin: (origin: any, callback: any) => {
-    if (whitelist.includes(origin) || whitelist.includes("*")) {
-      callback(null, true);
-    } else {
-      callback(new Error("Not allowed by CORS"));
-    }
-  },
-};
+const corsOptions = {};
 
 const app = express();

[Timeout] BlockStatement
src/app.ts:22:43
 
 const whitelist = ["*"]; // arreglo con todos los fronts que va aceptar
 const corsOptions = {
-  origin: (origin: any, callback: any) => {
-    if (whitelist.includes(origin) || whitelist.includes("*")) {
-      callback(null, true);
-    } else {
-      callback(new Error("Not allowed by CORS"));
-    }
-  },
+  origin: (origin: any, callback: any) => {},
 };
 

[Killed] LogicalOperator
src/app.ts:23:9
 const whitelist = ["*"]; // arreglo con todos los fronts que va aceptar
 const corsOptions = {
   origin: (origin: any, callback: any) => {
-    if (whitelist.includes(origin) || whitelist.includes("*")) {
+    if (whitelist.includes(origin) && whitelist.includes("*")) {
       callback(null, true);
     } else {
killedBy: can only be accessed if user is signed in
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 401
Received: 400

[Killed] ConditionalExpression
src/app.ts:23:9
 const whitelist = ["*"]; // arreglo con todos los fronts que va aceptar
 const corsOptions = {
   origin: (origin: any, callback: any) => {
-    if (whitelist.includes(origin) || whitelist.includes("*")) {
+    if (false) {
       callback(null, true);
     } else {
killedBy: return a 404 if the provided id does not exist
statusReason: Error: expected 404 "Not Found", got 400 "Bad Request"

[Survived] BooleanLiteral
src/app.ts:24:22
 const corsOptions = {
   origin: (origin: any, callback: any) => {
     if (whitelist.includes(origin) || whitelist.includes("*")) {
-      callback(null, true);
+      callback(null, false);
     } else {
       callback(new Error("Not allowed by CORS"));

[NoCoverage] BlockStatement
src/app.ts:25:12
   origin: (origin: any, callback: any) => {
     if (whitelist.includes(origin) || whitelist.includes("*")) {
       callback(null, true);
-    } else {
-      callback(new Error("Not allowed by CORS"));
-    }
+    } else {}
   },
 };

[Survived] BooleanLiteral
src/app.ts:32:24
 };
 
 const app = express();
-app.set("trust proxy", true); // esto es para que podamos ingresar y confiar en el proxy
+app.set("trust proxy", false); // esto es para que podamos ingresar y confiar en el proxy
 
 // Middlewares

[Survived] LogicalOperator
src/app.ts:42:7
   cookieSession({
     signed: false, // esto es para desactivar el encriptado de las cookies
     secure:
-      !EnvironmentsVerification.isTest &&
-      !EnvironmentsVerification.isDevelopment, // seguridad - solo se puede ingresar por https, en local lo ponemos en false de momento
+      !EnvironmentsVerification.isTest || !EnvironmentsVerification.isDevelopment, // seguridad - solo se puede ingresar por https, en local lo ponemos en false de momento
   })
 );

[Survived] ConditionalExpression
src/app.ts:42:7
   cookieSession({
     signed: false, // esto es para desactivar el encriptado de las cookies
     secure:
-      !EnvironmentsVerification.isTest &&
-      !EnvironmentsVerification.isDevelopment, // seguridad - solo se puede ingresar por https, en local lo ponemos en false de momento
+      false, // seguridad - solo se puede ingresar por https, en local lo ponemos en false de momento
   })
 );

[NoCoverage] BooleanLiteral
src/app.ts:43:7
     signed: false, // esto es para desactivar el encriptado de las cookies
     secure:
       !EnvironmentsVerification.isTest &&
-      !EnvironmentsVerification.isDevelopment, // seguridad - solo se puede ingresar por https, en local lo ponemos en false de momento
+      EnvironmentsVerification.isDevelopment, // seguridad - solo se puede ingresar por https, en local lo ponemos en false de momento
   })
 );

[NoCoverage] BlockStatement
src/app.ts:55:26
 routes.push(new GetAllTicketRouteController(app));
 routes.push(new UpdateTicketRouteController(app));
 
-app.all("*", async () => {
-  throw new NotFoundError();
-});
+app.all("*", async () => {});
 app.use(ErrorHandlerMiddleware.handler);
 
