[Survived] StringLiteral
tickets/events/lisener/order-cancelled-listener.ts:14:25
 class OrderCancelledListener extends BaseListener<OrderCancelledEvent> {
   subject: OrderSubjects.OrderCancelled = OrderSubjects.OrderCancelled;
   queueGroupName: string = queueGroupName;
-  durableName: string = "ticket-service-order-cancelled";
+  durableName: string = "";
 
   async onMessage(

[Killed] BlockStatement
tickets/events/lisener/order-cancelled-listener.ts:19:20
   async onMessage(
     data: OrderCancelledEvent["data"],
     msg: Message
-  ): Promise<void> {
-    // buscar el ticket que fue reservado por la orden
-    const ticket = await GetTicketService.get(data.ticket.id);
-
-    // si no hay un ticket lanzar un error
-    if (!ticket) throw new Error("Ticket not found!");
-
-    // hacer que el ticker este reservado agregando el id de la orden
-    const ticketUpdated = await UpdateTicketService.update(data.ticket.id, {
-      orderId: undefined, // este orderId significa que esta reservado por lo tanto no puede estar editable mientras el user esta haciendo la compra
-    });
-
-    // emitir un evento de actualizacion del ticket para que todos los demas servicios se enteren de que tambien esta siendo usado por una orden de algun usuarios
-    await new TicketUpdatedPublisher(this.client).publish({
-      id: ticketUpdated.id,
-      title: ticketUpdated.title,
-      price: ticketUpdated.price.valueOf(),
-      userId: ticketUpdated.userId,
-      version: ticketUpdated.version!,
-      orderId: data.id,
-    });
-
-    msg.ack();
-  }
+  ): Promise<void> {}
 }
 
killedBy: sets the userId of the cancelled ticket
statusReason: Error: expect(received).not.toBeDefined()

Received: "642c26800e9e8c91f989e8c0"

[Killed] ConditionalExpression
tickets/events/lisener/order-cancelled-listener.ts:24:9
     const ticket = await GetTicketService.get(data.ticket.id);
 
     // si no hay un ticket lanzar un error
-    if (!ticket) throw new Error("Ticket not found!");
+    if (true) throw new Error("Ticket not found!");
 
     // hacer que el ticker este reservado agregando el id de la orden
killedBy: sets the userId of the cancelled ticket
statusReason: Error: Ticket not found!

[Killed] BooleanLiteral
tickets/events/lisener/order-cancelled-listener.ts:24:9
     const ticket = await GetTicketService.get(data.ticket.id);
 
     // si no hay un ticket lanzar un error
-    if (!ticket) throw new Error("Ticket not found!");
+    if (ticket) throw new Error("Ticket not found!");
 
     // hacer que el ticker este reservado agregando el id de la orden
killedBy: sets the userId of the cancelled ticket
statusReason: Error: Ticket not found!

[Killed] ObjectLiteral
tickets/events/lisener/order-cancelled-listener.ts:27:76
     if (!ticket) throw new Error("Ticket not found!");
 
     // hacer que el ticker este reservado agregando el id de la orden
-    const ticketUpdated = await UpdateTicketService.update(data.ticket.id, {
-      orderId: undefined, // este orderId significa que esta reservado por lo tanto no puede estar editable mientras el user esta haciendo la compra
-    });
+    const ticketUpdated = await UpdateTicketService.update(data.ticket.id, {});
 
     // emitir un evento de actualizacion del ticket para que todos los demas servicios se enteren de que tambien esta siendo usado por una orden de algun usuarios
killedBy: sets the userId of the cancelled ticket
statusReason: Error: expect(received).not.toBeDefined()

Received: "642c2690252e8ef9828d82d8"
