[NoCoverage] BooleanLiteral
src/index.ts:13:7
 } from "./tickets/events/lisener";
 
 const start = async () => {
-  if (!process.env.JWT_KEY) throw new Error("JWT_KEY undefined!!!");
+  if (process.env.JWT_KEY) throw new Error("JWT_KEY undefined!!!");
   if (!process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
   if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");

[NoCoverage] ConditionalExpression
src/index.ts:13:7
 } from "./tickets/events/lisener";
 
 const start = async () => {
-  if (!process.env.JWT_KEY) throw new Error("JWT_KEY undefined!!!");
+  if (false) throw new Error("JWT_KEY undefined!!!");
   if (!process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
   if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");

[NoCoverage] ConditionalExpression
src/index.ts:14:7
 
 const start = async () => {
   if (!process.env.JWT_KEY) throw new Error("JWT_KEY undefined!!!");
-  if (!process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
+  if (true) throw new Error("MONGO_URI undefined!!!");
   if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
   if (!process.env.NATS_CLIENT_ID)

[NoCoverage] BooleanLiteral
src/index.ts:14:7
 
 const start = async () => {
   if (!process.env.JWT_KEY) throw new Error("JWT_KEY undefined!!!");
-  if (!process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
+  if (process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
   if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
   if (!process.env.NATS_CLIENT_ID)

[NoCoverage] ConditionalExpression
src/index.ts:15:7
 const start = async () => {
   if (!process.env.JWT_KEY) throw new Error("JWT_KEY undefined!!!");
   if (!process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
-  if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
+  if (true) throw new Error("NATS_URL undefined!!!");
   if (!process.env.NATS_CLIENT_ID)
     throw new Error("NATS_CLIENT_ID undefined!!!");

[NoCoverage] BooleanLiteral
src/index.ts:15:7
 const start = async () => {
   if (!process.env.JWT_KEY) throw new Error("JWT_KEY undefined!!!");
   if (!process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
-  if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
+  if (process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
   if (!process.env.NATS_CLIENT_ID)
     throw new Error("NATS_CLIENT_ID undefined!!!");

[NoCoverage] ConditionalExpression
src/index.ts:16:7
   if (!process.env.JWT_KEY) throw new Error("JWT_KEY undefined!!!");
   if (!process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
   if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
-  if (!process.env.NATS_CLIENT_ID)
+  if (false)
     throw new Error("NATS_CLIENT_ID undefined!!!");
   if (!process.env.NATS_CLUSTER) throw new Error("NATS_CLUSTER undefined!!!");

[NoCoverage] ConditionalExpression
src/index.ts:16:7
   if (!process.env.JWT_KEY) throw new Error("JWT_KEY undefined!!!");
   if (!process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
   if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
-  if (!process.env.NATS_CLIENT_ID)
+  if (true)
     throw new Error("NATS_CLIENT_ID undefined!!!");
   if (!process.env.NATS_CLUSTER) throw new Error("NATS_CLUSTER undefined!!!");

[NoCoverage] StringLiteral
src/index.ts:17:21
   if (!process.env.MONGO_URI) throw new Error("MONGO_URI undefined!!!");
   if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
   if (!process.env.NATS_CLIENT_ID)
-    throw new Error("NATS_CLIENT_ID undefined!!!");
+    throw new Error("");
   if (!process.env.NATS_CLUSTER) throw new Error("NATS_CLUSTER undefined!!!");
   routes.forEach((route: RouteControllerBase) => {

[NoCoverage] ConditionalExpression
src/index.ts:18:7
   if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
   if (!process.env.NATS_CLIENT_ID)
     throw new Error("NATS_CLIENT_ID undefined!!!");
-  if (!process.env.NATS_CLUSTER) throw new Error("NATS_CLUSTER undefined!!!");
+  if (false) throw new Error("NATS_CLUSTER undefined!!!");
   routes.forEach((route: RouteControllerBase) => {
     console.log(

[NoCoverage] BooleanLiteral
src/index.ts:18:7
   if (!process.env.NATS_URL) throw new Error("NATS_URL undefined!!!");
   if (!process.env.NATS_CLIENT_ID)
     throw new Error("NATS_CLIENT_ID undefined!!!");
-  if (!process.env.NATS_CLUSTER) throw new Error("NATS_CLUSTER undefined!!!");
+  if (process.env.NATS_CLUSTER) throw new Error("NATS_CLUSTER undefined!!!");
   routes.forEach((route: RouteControllerBase) => {
     console.log(

[NoCoverage] BlockStatement
src/index.ts:19:50
   if (!process.env.NATS_CLIENT_ID)
     throw new Error("NATS_CLIENT_ID undefined!!!");
   if (!process.env.NATS_CLUSTER) throw new Error("NATS_CLUSTER undefined!!!");
-  routes.forEach((route: RouteControllerBase) => {
-    console.log(
-      `Routes configured for ${route.name}, with path: ${route.path}`
-    );
-  });
+  routes.forEach((route: RouteControllerBase) => {});
   app.listen(3000, async () => {
     console.log("The Server is running!!!");

[NoCoverage] StringLiteral
src/index.ts:21:7
   if (!process.env.NATS_CLUSTER) throw new Error("NATS_CLUSTER undefined!!!");
   routes.forEach((route: RouteControllerBase) => {
     console.log(
-      `Routes configured for ${route.name}, with path: ${route.path}`
+      ``
     );
   });

[NoCoverage] BlockStatement
src/index.ts:24:32
       `Routes configured for ${route.name}, with path: ${route.path}`
     );
   });
-  app.listen(3000, async () => {
-    console.log("The Server is running!!!");
-    await MongoDBConnection.sync();
-    await NatsClientWrapper.connect(
-      process.env.NATS_CLUSTER!, // este es el nombre del cluster que declaramos que tomaria el nats-deployment.yml en sus argumentos
-      process.env.NATS_CLIENT_ID!, // este es el id del servicio, dejamos el nombre para luego el dashboard de eventos poder saber que servicio es
-      process.env.NATS_URL!
-    );
-    NatsClientWrapper.client.on("close", () => {
-      // este evento se captura cuando se cierra la conexion
-      console.log("NATS connection closed!!!");
-      process.exit();
-    });
-
-    // capturamos con estos dos eventos del servidor cuando se cierre y cerramos correctamente la conexion con NATS
-    process.on("SIGINT", () => NatsClientWrapper.client.close());
-    process.on("SIGTERM", () => NatsClientWrapper.client.close());
-
-    new OrderCreatedListener(NatsClientWrapper.client).listen();
-    new OrderCancelledListener(NatsClientWrapper.client).listen();
-  });
+  app.listen(3000, async () => {});
 };
 

[NoCoverage] StringLiteral
src/index.ts:25:17
     );
   });
   app.listen(3000, async () => {
-    console.log("The Server is running!!!");
+    console.log("");
     await MongoDBConnection.sync();
     await NatsClientWrapper.connect(

[NoCoverage] BlockStatement
src/index.ts:32:48
       process.env.NATS_CLIENT_ID!, // este es el id del servicio, dejamos el nombre para luego el dashboard de eventos poder saber que servicio es
       process.env.NATS_URL!
     );
-    NatsClientWrapper.client.on("close", () => {
-      // este evento se captura cuando se cierra la conexion
-      console.log("NATS connection closed!!!");
-      process.exit();
-    });
+    NatsClientWrapper.client.on("close", () => {});
 
     // capturamos con estos dos eventos del servidor cuando se cierre y cerramos correctamente la conexion con NATS

[NoCoverage] ArrowFunction
src/index.ts:39:26
     });
 
     // capturamos con estos dos eventos del servidor cuando se cierre y cerramos correctamente la conexion con NATS
-    process.on("SIGINT", () => NatsClientWrapper.client.close());
+    process.on("SIGINT", () => undefined);
     process.on("SIGTERM", () => NatsClientWrapper.client.close());
 

[NoCoverage] ArrowFunction
src/index.ts:40:27
 
     // capturamos con estos dos eventos del servidor cuando se cierre y cerramos correctamente la conexion con NATS
     process.on("SIGINT", () => NatsClientWrapper.client.close());
-    process.on("SIGTERM", () => NatsClientWrapper.client.close());
+    process.on("SIGTERM", () => undefined);
 
     new OrderCreatedListener(NatsClientWrapper.client).listen();
