[NoCoverage] BlockStatement
src/nats-client.ts:6:67
 class NatsClientWrapper {
   public _client?: Stan;
 
-  async connect(clusterId: string, clientId: string, url: string) {
-    this._client = nats.connect(clusterId, clientId, { url });
-
-    return new Promise<void>((resolve, reject) => {
-      this.client.on("connect", () => {
-        console.log("Connected to NATS!!!!");
-        resolve();
-      });
-      this.client.on("error", (err) => {
-        console.log(`ERROR => ${err}`);
-        reject(err);
-      });
-    });
-  }
+  async connect(clusterId: string, clientId: string, url: string) {}
 
   get client() {

[NoCoverage] ObjectLiteral
src/nats-client.ts:7:54
   public _client?: Stan;
 
   async connect(clusterId: string, clientId: string, url: string) {
-    this._client = nats.connect(clusterId, clientId, { url });
+    this._client = nats.connect(clusterId, clientId, {});
 
     return new Promise<void>((resolve, reject) => {

[NoCoverage] BlockStatement
src/nats-client.ts:9:51
   async connect(clusterId: string, clientId: string, url: string) {
     this._client = nats.connect(clusterId, clientId, { url });
 
-    return new Promise<void>((resolve, reject) => {
-      this.client.on("connect", () => {
-        console.log("Connected to NATS!!!!");
-        resolve();
-      });
-      this.client.on("error", (err) => {
-        console.log(`ERROR => ${err}`);
-        reject(err);
-      });
-    });
+    return new Promise<void>((resolve, reject) => {});
   }
 

[NoCoverage] BlockStatement
src/nats-client.ts:10:39
     this._client = nats.connect(clusterId, clientId, { url });
 
     return new Promise<void>((resolve, reject) => {
-      this.client.on("connect", () => {
-        console.log("Connected to NATS!!!!");
-        resolve();
-      });
+      this.client.on("connect", () => {});
       this.client.on("error", (err) => {
         console.log(`ERROR => ${err}`);

[NoCoverage] StringLiteral
src/nats-client.ts:10:22
     this._client = nats.connect(clusterId, clientId, { url });
 
     return new Promise<void>((resolve, reject) => {
-      this.client.on("connect", () => {
+      this.client.on("", () => {
         console.log("Connected to NATS!!!!");
         resolve();

[NoCoverage] BlockStatement
src/nats-client.ts:14:40
         console.log("Connected to NATS!!!!");
         resolve();
       });
-      this.client.on("error", (err) => {
-        console.log(`ERROR => ${err}`);
-        reject(err);
-      });
+      this.client.on("error", (err) => {});
     });
   }
