[Timeout] BlockStatement
src/tickets/api/get-all-ticket-route-controller.ts:15:46
     this.app.get(
       this.path,
       VerifyErrorMiddleware.verify,
-      async (req: Request, res: Response) => {
-        const tickets: TicketDocument[] = await GetAllTicketService.getAll();
-
-        res.status(200).send({ tickets });
-      }
+      async (req: Request, res: Response) => {}
     );
     return this.app;
