[Survived] StringLiteral
src/tickets/api/get-ticket-route-controller.ts:8:16
 
 export default class GetTicketRouteController extends RouteControllerBase {
   constructor(app: express.Application) {
-    super(app, "GetOneRoute", "/api/tickets/:id");
+    super(app, "", "/api/tickets/:id");
   }
 

[Timeout] BlockStatement
src/tickets/api/get-ticket-route-controller.ts:15:46
     this.app.get(
       this.path,
       VerifyErrorMiddleware.verify,
-      async (req: Request, res: Response) => {
-        const { id } = req.params;
-
-        const ticket: TicketDocument | null = await GetTicketService.get(id);
-
-        if (!ticket) throw new NotFoundError();
-
-        res.status(200).send({ ticket });
-      }
+      async (req: Request, res: Response) => {}
     );
     return this.app;

[Killed] ConditionalExpression
src/tickets/api/get-ticket-route-controller.ts:20:13
 
         const ticket: TicketDocument | null = await GetTicketService.get(id);
 
-        if (!ticket) throw new NotFoundError();
+        if (false) throw new NotFoundError();
 
         res.status(200).send({ ticket });
killedBy: return a 404 if the ticket is not found
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 404
Received: 200

[Killed] BooleanLiteral
src/tickets/api/get-ticket-route-controller.ts:20:13
 
         const ticket: TicketDocument | null = await GetTicketService.get(id);
 
-        if (!ticket) throw new NotFoundError();
+        if (ticket) throw new NotFoundError();
 
         res.status(200).send({ ticket });
killedBy: update a ticket
statusReason: Error: expected 200 "OK", got 404 "Not Found"
