[Timeout] BlockStatement
src/__mocks__/nats-client.ts:5:72
   client = {
     publish: jest
       .fn()
-      .mockImplementation((subject: string, data: string, callback) => {
-        callback();
-      }),
+      .mockImplementation((subject: string, data: string, callback) => {}),
   };
 }
