[Killed] StringLiteral
src/tickets/api/create-ticket-route-controller.ts:17:31
 
 export default class CreateTicketRouteController extends RouteControllerBase {
   constructor(app: express.Application) {
-    super(app, "CreateRoute", "/api/tickets");
+    super(app, "CreateRoute", "");
   }
 
killedBy: return the ticket if the ticket is found
statusReason: Error: expected 201 "Created", got 404 "Not Found"

[Timeout] BlockStatement
src/tickets/api/create-ticket-route-controller.ts:32:46
       VerifyCurrentUser.verify,
       RequiredUserAuthentication.required,
       VerifyErrorMiddleware.verify,
-      async (req: Request, res: Response) => {
-        const { title, price }: TicketRequestDto = req.body;
-
-        const ticketCreated: TicketDocument = await CreateTicketService.create({
-          title,
-          price,
-          userId: req.currentUser!.id,
-        });
-
-        await new TicketCreatedPublisher(NatsClientWrapper.client).publish({
-          id: ticketCreated.id,
-          title: ticketCreated.title,
-          price: ticketCreated.price.valueOf(),
-          userId: ticketCreated.userId,
-          version: ticketCreated.version!,
-        });
-
-        res.status(201).send({ ticket: ticketCreated });
-      }
+      async (req: Request, res: Response) => {}
     );
     return this.app;
