[Survived] StringLiteral
src/tickets/api/update-ticket-route-controller.ts:20:16
 
 export default class UpdateTicketRouteController extends RouteControllerBase {
   constructor(app: express.Application) {
-    super(app, "UpdateRoute", "/api/tickets/:id");
+    super(app, "", "/api/tickets/:id");
   }
 

[Killed] StringLiteral
src/tickets/api/update-ticket-route-controller.ts:27:14
     this.app.put(
       this.path,
       [
-        body("title").notEmpty().withMessage("You must supply a title"),
+        body("").notEmpty().withMessage("You must supply a title"),
         body("price")
           .isFloat({ gt: 0 })
killedBy: return a 400 if the user provides and invalid title or price
statusReason: Error: expected 400 "Bad Request", got 200 "OK"

[Killed] ConditionalExpression
src/tickets/api/update-ticket-route-controller.ts:43:13
 
         if (!wantedTicket) throw new NotFoundError();
 
-        if (wantedTicket.orderId)
+        if (false)
           throw new BadRequestError(
             "Ticket is reserved, and not is editable now!"
killedBy: should give an error if the ticket is in order
statusReason: Error: expected 400 "Bad Request", got 404 "Not Found"

[Timeout] StringLiteral
src/tickets/api/update-ticket-route-controller.ts:45:13
 
         if (wantedTicket.orderId)
           throw new BadRequestError(
-            "Ticket is reserved, and not is editable now!"
+            ""
           );
 

[Killed] ObjectLiteral
src/tickets/api/update-ticket-route-controller.ts:53:11
 
         const ticketUpdated: TicketDocument = await UpdateTicketService.update(
           id,
-          {
-            title,
-            price,
-            userId: req.currentUser.id,
-          }
+          {}
         );
 
killedBy: update a ticket
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Example Updated"
Received: "Example1"
