[Timeout] ObjectLiteral
tickets/domain/models/ticket-dao.ts:10:12
 
 const ticketSchema = new Schema<TicketDto>(
   {
-    title: {
-      type: String,
-      require: true,
-      unique: true,
-    },
+    title: {},
     price: {
       type: Number,

[Timeout] BooleanLiteral
tickets/domain/models/ticket-dao.ts:12:16
   {
     title: {
       type: String,
-      require: true,
+      require: false,
       unique: true,
     },

[Timeout] BooleanLiteral
tickets/domain/models/ticket-dao.ts:13:15
     title: {
       type: String,
       require: true,
-      unique: true,
+      unique: false,
     },
     price: {

[Timeout] ObjectLiteral
tickets/domain/models/ticket-dao.ts:15:12
       require: true,
       unique: true,
     },
-    price: {
-      type: Number,
-      require: true,
-    },
+    price: {},
     userId: {
       type: String,

[Timeout] BooleanLiteral
tickets/domain/models/ticket-dao.ts:17:16
     },
     price: {
       type: Number,
-      require: true,
+      require: false,
     },
     userId: {

[Survived] ObjectLiteral
tickets/domain/models/ticket-dao.ts:23:14
       type: String,
       require: true,
     },
-    orderId: {
-      type: String,
-    },
+    orderId: {},
   },
   {

[Killed] ObjectLiteral
tickets/domain/models/ticket-dao.ts:28:13
     },
   },
   {
-    toJSON: {
-      transform(doc, ret) {
-        ret.id = ret._id;
-        delete ret._id;
-      },
-    },
+    toJSON: {},
   }
 );
killedBy: return the ticket if the ticket is found
statusReason: Error: expected 200 "OK", got 400 "Bad Request"

[Killed] BlockStatement
tickets/domain/models/ticket-dao.ts:29:27
   },
   {
     toJSON: {
-      transform(doc, ret) {
-        ret.id = ret._id;
-        delete ret._id;
-      },
+      transform(doc, ret) {},
     },
   }
killedBy: return a 401 if the user does not own the ticket
statusReason: Error: expected 401 "Unauthorized", got 400 "Bad Request"
