[Killed] ConditionalExpression
src/tickets/domain/ticket-crud-repository.ts:10:16
 class TicketCrudRepository implements CRUDRepository<TicketDto> {
   async findAll(limit = 10, page = 0): Promise<TicketDocument[]> {
     return TicketDao.find({
-      orderId: undefined || null,
+      orderId: false,
     })
       .limit(limit)
killedBy: return all tickets
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Killed] ConditionalExpression
src/tickets/domain/ticket-crud-repository.ts:10:16
 class TicketCrudRepository implements CRUDRepository<TicketDto> {
   async findAll(limit = 10, page = 0): Promise<TicketDocument[]> {
     return TicketDao.find({
-      orderId: undefined || null,
+      orderId: true,
     })
       .limit(limit)
killedBy: return all tickets
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Killed] ArithmeticOperator
src/tickets/domain/ticket-crud-repository.ts:13:13
       orderId: undefined || null,
     })
       .limit(limit)
-      .skip(limit * page)
+      .skip(limit / page)
       .exec();
   }
killedBy: return all tickets
statusReason: TypeError: Cannot read properties of undefined (reading 'title')
